app/controllers/purchase_infos_controller.rb

SELECT `purchase_infos`.* FROM `purchase_infos`
---
  def index
    @purchase_infos = PurchaseInfo.all

INSERT INTO `purchase_infos` (`purchaser_name`, `created_at`, `updated_at`) VALUES ('[\"purchaser name\\titem description\\titem price\\tpurchase count\\tmerchant address\\tmerchant name\", \"João Silva\\tR$10 off R$20 of food\\t10.0\\t2\\t987 Fake St\\tBob\'s Pizza\", \"Amy Pond\\tR$30 of awesome for R$10\\t10.0\\t5\\t456 Unreal Rd\\tTom\'s Awesome Shop\", \"Marty McFly\\tR$20 Sneakers for R$5\\t5.0\\t1\\t123 Fake St\\tSneaker Store Emporium\", \"Snake Plissken\\tR$20 Sneakers for R$5\\t5.0\\t4\\t123 Fake St\\tSneaker Store Emporium\"]', '2018-01-11 23:25:06', '2018-01-11 23:25:06')
---
  def create
    #Verifica se existe arquivo, se não existir faz a inserção normal dos dados
    if purchase_info_params[:temp_file].present?
      data = purchase_info_params[:temp_file] if purchase_info_params.present? && purchase_info_params[:temp_file].present?
      data = data.read.force_encoding('utf-8')
      #Intera sobre as linhas
      parse_data data
      redirect_to purchase_infos_path, notice: 'File was successfully created.'
    else
      @purchase_info = PurchaseInfo.new(purchase_info_params)

      respond_to do |format|
        if @purchase_info.save

DELETE FROM `purchase_infos` WHERE `purchase_infos`.`id` = 45
---
  def destroy
    @purchase_info.destroy

SELECT  `purchase_infos`.* FROM `purchase_infos` WHERE `purchase_infos`.`id` = 45 LIMIT 1
---
    def set_purchase_info
      @purchase_info = PurchaseInfo.find(params[:id])