app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`login`, `password_salt`, `crypted_password`, `persistence_token`, `perishable_token`, `login_count`, `current_login_at`, `current_login_ip`, `last_request_at`, `created_at`, `updated_at`) VALUES ('lucas', '0atSSt375Kt6OA4pgbm', '400$8$4e$99f5e4c5c2222fa3$36516e97bc1b5a2d0fd76e1cf5357f0263e56ffa0373d5f783c8fceac582fc6d', 'b85f8fcf7b9ba85b15cf9d757495c17bc6ccfd23517f2bfaf81724ef38d8d6812573be0d34affc8e79d1a5eb4c689c0c7fb688157679395c8b0cfba976828672', '2iKteKFlfNlmS5ENopx', 1, '2018-01-12 14:26:39', '127.0.0.1', '2018-01-12 14:26:39', '2018-01-12 14:26:39', '2018-01-12 14:26:39')